Revit 2027 API
Document.Application Property
Returns the Application in which the Document resides.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Application Application { get; }
Public ReadOnly Property Application As Application
	Get
public:
property Application^ Application {
	Application^ get ();
}
member Application : Application with get
Property Value
Application
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace